优化闭包
